Revit 2027 API
CableTray.GetShapeType Method
 Returns the shape type for the cable tray.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CableTrayShape GetShapeType()
Public Function GetShapeType As CableTrayShape
public:
CableTrayShape GetShapeType()
member GetShapeType : unit -> CableTrayShape
Return Value
CableTrayShape
 The shape type.
See Also
Reference
CableTray Class
Autodesk.Revit.DB.Electrical Namespace